<template>
    <div class="about">
  
      <h1>О нас</h1>
      <p>Наш зоопарк самый крупный в ПФО.</p>
      <p >Что такое Lorem Ipsum?
Lorem Ipsum — это просто шаблонный текст, используемый в полиграфической и типографской промышленности. Lorem Ipsum был стандартным шаблонным текстом в отрасли с 1500-х годов, когда неизвестный печатник взял наборный шрифт и зашифровал его, чтобы создать образец шрифта. Он пережил не только пять столетий, но и переход к электронному вёрстанию, практически не изменившись. Он стал популярен в 1960-х годах, когда были выпущены листы Letraset с фрагментами Lorem Ipsum, а в последнее время — с программным обеспечением для настольных издательских систем, таким как Aldus PageMaker, в котором есть версии Lorem Ipsum.

Почему мы им пользуемся?
Давно известно, что при просмотре макета страницы читателя отвлекает читабельный контент. Смысл использования Lorem Ipsum в том, что у него более-менее нормальное распределение букв, в отличие от использования 'Контента здесь, контента здесь', что делает его похожим на читабельный английский текст. Многие пакеты для настольных издательских систем и редакторы веб-страниц теперь используют Lorem Ipsum в качестве текста по умолчанию, и поиск по 'lorem ipsum' выдаст множество веб-сайтов, которые всё ещё находятся в разработке. На протяжении многих лет появлялись различные версии, иногда случайно, иногда намеренно (с добавлением юмора и тому подобного).


Откуда это берется?
Вопреки распространённому мнению, Lorem Ipsum — это не просто случайный текст. Он уходит корнями в произведение классической латинской литературы, написанное в 45 году до н. э., то есть ему более 2000 лет. Ричард МакКлинток, профессор латыни в Хэмпден-Сиднейском колледже в Вирджинии, нашёл одно из самых непонятных латинских слов, consectetur, в отрывке Lorem Ipsum и, просмотрев все упоминания этого слова в классической литературе, обнаружил достоверный источник. Lorem Ipsum взят из разделов 1.10.32 и 1.10.33 книги Цицерона «О пределах добра и зла» (De Finibus Bonorum et Malorum), написанной в 45 году до н. э. Эта книга представляет собой трактат по теории этики, очень популярный в эпоху Возрождения. Первая строка Lorem Ipsum, «Lorem ipsum dolor sit amet..», взята из раздела 1.10.32.

Стандартный фрагмент Lorem Ipsum, используемый с 1500-х годов, приведён ниже для ознакомления. Разделы 1.10.32 и 1.10.33 из «О пределах добра и зла» Цицерона также воспроизведены в их первоначальном виде с английскими версиями из перевода Х. Рэкхема 1914 года.

Где я могу их раздобыть?
Существует множество вариантов отрывков из Lorem Ipsum, но большинство из них в той или иной форме подверглись изменениям: в них добавлен юмор или случайные слова, которые выглядят даже отдалённо правдоподобно. Если вы собираетесь использовать отрывок из Lorem Ipsum, вам нужно убедиться, что в середине текста нет ничего постыдного. Все генераторы Lorem Ipsum в интернете, как правило, повторяют заранее заданные фрагменты по мере необходимости, что делает его первым настоящим генератором в интернете. Он использует словарь, содержащий более 200 латинских слов, в сочетании с несколькими образцами структуры предложений для создания Lorem Ipsum, который выглядит естественно. Таким образом, сгенерированный Lorem Ipsum всегда свободен от повторений, неуместного юмора, нехарактерных слов и т. д.</p>
    </div>
  </template>
  
  <script lang="ts">
  import { defineComponent, ref } from 'vue'
  export default defineComponent({
    name: 'About',
  });
  </script>
  <style scoped>
.about
{


background-image: url(/image/lion.png);
background-position: center center;
    background-repeat: no-repeat;
background-attachment: fixed;
   background-size: cover;
}
h1
{
  color: white;
  text-align: center;
}
p
{
  margin-left: auto;
  margin-right: auto;
  text-align: justify;
  color: white;
  width: 900px;
  background-color: rgba(0, 0, 0, 0.5);
  padding: 10px;
}
@media only screen and (max-width: 960px) 
{
  p {
    width: 100%; /* текст занимает всю ширину экрана */
  text-align: left;
padding: 0;
  }
  .about
  {
    font-size: 14pt;
  }
}
</style>
 